app/controllers/todo_controller.rb

    def show
        @t=Todo.find(params[:id])
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT 1  [["id", 1]]

    def create
        t=Todo.new
        t.description=params[:description]
        t.pomodoro_estimate=params[:pomodoro_estimate]
        t.completed=false
        t.save
---
INSERT INTO "todos" ("description", "pomodoro_estimate", "completed", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["description", "nap time"], ["pomodoro_estimate", "3"], ["completed", "f"], ["created_at", "2018-08-19 19:57:00.999914"], ["updated_at", "2018-08-19 19:57:00.999914"]]

    def destroy
        Todo.destroy(params[:id])
---
DELETE FROM "todos" WHERE "todos"."id" = $1  [["id", 33]]

    def edit
        @t=Todo.find(params[:id])
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT 1  [["id", 3]]

    def update
        t=Todo.find(params[:id])
        t.description=params[:description]
        t.pomodoro_estimate=params[:pomodoro_estimate]
        t.completed=false
        t.save
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT 1  [["id", 10]]
UPDATE "todos" SET "pomodoro_estimate" = $1, "completed" = $2, "updated_at" = $3 WHERE "todos"."id" = $4  [["pomodoro_estimate", "4"], ["completed", "f"], ["updated_at", "2018-08-19 21:25:28.914825"], ["id", 10]]